Revit.Elements.Material.Name
Get Material Name
Returns:

Revit.Elements.Material.Shininess
Get Shininess

Revit.Elements.Material.Smoothness
Get Smoothness

Revit.Elements.Material.Transparency
Get Transparency

Revit.Elements.Material.SurfacePatternColor
Get SurfacePatternColor

Revit.Elements.Material.MaterialClass
Get Material Class

Revit.Elements.Material.MaterialCategory
Get Material category

Revit.Elements.Material.CutPatternColor
Get cut pattern color

Revit.Elements.Material.Color
Get color

Revit.Elements.Material.CutPatternId
Get cut pattern id

Revit.Elements.Material.AppearanceParameters
Get all apperance parameters

Revit.Elements.Material.ThermalParameters
Get all thermal parameters

Revit.Elements.Material.StructuralParameters
Get all structural parameters

Revit.Elements.Material.ToDSColor(Autodesk.Revit.DB.Color)
Convert Revit to DS Color
color:
Returns: